results/spring-quarkus-perf-comparison/2026-01-14_17-09-57/wrk-spring4-native-0.log
Running 30s test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.91ms   28.61ms 534.77ms   90.28%
    Req/Sec   4086.87    748.48  4376.00     96.77
  126693 requests in 30.013s, 101.21MB read
Requests/sec: 4221.27
Transfer/sec:   3.37MB
Socket errors: connectionErrors 1253, requestTimeouts 0