results/spring-quarkus-perf-comparison/2026-01-14_17-09-57/wrk-spring4-virtual-2.log
Running 30s test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.20ms   10.19ms 116.92ms   88.64%
    Req/Sec   9573.06   1758.73  10194.00     96.77
  296765 requests in 30.009s, 237.19MB read
Requests/sec: 9889.20
Transfer/sec:   7.90MB
Socket errors: connectionErrors 2905, requestTimeouts 0