results/spring-quarkus-perf-comparison/2026-01-14_17-09-57/wrk-warmup-spring4-jvm-0.log
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.16ms   42.13ms 780.14ms   90.95%
    Req/Sec   4012.58   1722.11  7397.00     60.83
  481510 requests in 120.017s, 384.87MB read
Requests/sec: 4012.01
Transfer/sec:   3.21MB
Socket errors: connectionErrors 4738, requestTimeouts 0